import { Component, OnInit } from '@angular/core'

@Component({
  selector: 'app-terms',
  templateUrl: './terms.component.html',
  styleUrls: ['./terms.component.scss'],
})
export class TermsComponent implements OnInit {
  constructor() {}
  terms = `אני מצהיר כי המידע שמסרתי במסגרת פניתי לקבלת סיוע משפטי ("**הפניה**") הינו אמת ומדויק למיטב ידיעתי.
  אני מצהיר כי ידוע לי שתפקידה של לשכת עורכי הדין הוא לצורכי תיווך בלבד, וכי את הפניה הלשכה מעבירה לעורך דין חיצוני שהתנדב לסייע בבחינת הפניה ובטיפולה (להלן: "**עורך הדין החיצוני**"). עוד ידוע לי כי עורך הדין החיצוני רשאי לסרב לטפל בפניה מכל סיבה שהיא, וככל שיבחר לטפל בה, הוא יעשה זאת בהתאם לשיקול דעתו המקצועי בלבד.

  ידוע לי כי הטיפול בפניה, ככל שיתבצע על ידי עורך הדין החיצוני, יעשה בהתנדבות מלאה ומבלי שעורך הדין החיצוני יגבה ממני כל תשלום בגין כך.
  
  לאור האמור, אני מצהיר ומאשר כי הלשכה אינה אחראית כלפי ו/או כלפי מי מטעמי לאי מתן מענה ו/או למענה שניתן לפניה, וכן אינה אחראית לאופן הטיפול בפניה, היקפה ותוכנה שיעשה על ידי עורך הדין החיצוני, על כל השלכות הטיפול ו/או תוצאותיו, ואני מוותר בזאת על כל טענה ו/או תביעה כלפי לשכת עורכי הדין והפועלים מטעמה בגין כל הפסד ו/או נזק שיגרמו לי בקשר עם האמור.
  
  אני מצהיר כי סיפקתי את כל המידע המבוקש בטופס הגשת הבקשה וצירפתי את כל המסמכים הנדרשים, ואני מבין כי אני אחראי לספק מסמכים אלה ואת המידע הרלבנטי לעורך הדין אשר יטפל בפניה, בהתאם לבקשתו.
  
  ידוע לי כי אני רשאי לבקש לעדכן, לתקן ו/או למחוק את המידע האישי שנמסר על ידי ללשכת עורכי הדין במסגרת הפניה באמצעות פניה בדואר אלקטרוני:  legal.aid@israelbar.org.il.`
  ngOnInit(): void {}
}
